# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on one-to-many and many-to-many relationships!

## Objectives

You will be able to:
- Query data using one-to-many and many-to-many joins
- Predict the resulting size of one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [1]:
#Your code here
import pandas as pd
import sqlite3

In [2]:
conn= sqlite3.connect('data.sqlite')
c= conn.cursor()

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [8]:
#Your code here
c.execute('''select firstName, lastName, city, state 
            from employees e
            join offices o
            using(officeCode)
            order by firstName''')
df= pd.DataFrame(c.fetchall())
df.columns= [i[0] for i in c.description]
print(len(df))
df.head(10)

23

  firstName   lastName           city state
0      Andy     Fixter         Sydney
1   Anthony        Bow  San Francisco    CA
2     Barry      Jones         London
3     Diane     Murphy  San Francisco    CA
4  Foon Yue      Tseng            NYC    NY
5    George     Vanauf            NYC    NY
6    Gerard     Bondur          Paris
7    Gerard  Hernandez          Paris
8      Jeff   Firrelli  San Francisco    CA
9     Julie   Firrelli         Boston    MA

## Customers and their Orders (a One-to-Many join)

Return a list of all the customers first and last names along with a record for each of their order numbers, order dates and statuses.

In [10]:
# Your code here
c.execute('''select customerName, orderNumber, orderDate, status
            from customers
            join orders
            using(customerNumber)''')
df= pd.DataFrame(c.fetchall())
df.columns= [i[0] for i in c.description]
print(len(df))
df.head()

326

         customerName orderNumber   orderDate   status
0   Atelier graphique       10123  2003-05-20  Shipped
1   Atelier graphique       10298  2004-09-27  Shipped
2   Atelier graphique       10345  2004-11-25  Shipped
3  Signal Gift Stores       10124  2003-05-21  Shipped
4  Signal Gift Stores       10278  2004-08-06  Shipped

## Customers and their Payments (another One-to-Many join)

Return a list of customers first and last names along with details about their payments including the amount and date of payments. Sort these results in descending order by the payment amount.

In [12]:
# Your code here
c.execute('''select customerName, paymentDate, amount
            from customers
            join payments
            using(customerNumber)
            order by amount desc''')
df= pd.DataFrame(c.fetchall())
df.columns= [i[0] for i in c.description]
print(len(df))
df.head()

273

                   customerName paymentDate   amount
0              FunGiftIdeas.com  2003-11-08  9977.85
1   Australian Gift Network, Co  2003-10-17  9821.32
2       Auto-Moto Classics Inc.  2004-12-06  9658.74
3  Australian Collectables, Ltd  2004-07-28  9415.13
4               Mini Auto Werke  2005-05-03  8807.12

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of customer first and last names, product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries which can make complex queries such as this much simpler!

In [16]:
# Your code here
c.execute('''select customerName, productName, quantityOrdered, orderDate
            from customers
            join orders
            using(customerNumber)
            join orderDetails
            using(orderNumber)
            join products
            using(productCode)
            order by orderDate desc''')
df= pd.DataFrame(c.fetchall())
df.columns= [i[0] for i in c.description]
print(len(df))
df.head()

2996

,customerName,productName,quantityOrdered,orderDate
0,La Rochelle Gifts,1962 LanciaA Delta 16V,38,2005-05-31
1,La Rochelle Gifts,1957 Chevy Pickup,33,2005-05-31
2,La Rochelle Gifts,1998 Chrysler Plymouth Prowler,28,2005-05-31
3,La Rochelle Gifts,1964 Mercedes Tour Bus,38,2005-05-31
4,La Rochelle Gifts,1926 Ford Fire Engine,19,2005-05-31

## Summary

In this lab, you practiced your knowledge on one-to-many and many-to-many relationships!